app/controllers/precincts_controller.rb

  def index
    precincts = Precinct.find(:all)
    points = {}
    @boundaries = []

    precincts.each do |precinct|
---
SELECT * FROM `precincts` LIMIT 1